{
    "body": {
        "job_post": "\nClipchamp is the go-to video platform with one simple mission: to empower anyone to tell stories worth sharing. Since 2016 we’ve attracted over seventeen million registered users globally and counting, and that’s only the beginning. We've now joined Microsoft's Office Product Group (OPG).\n\nBuilding and maintaining strong connections across location and time is critical in the world we live in, and the emotional power of media – video, audio, and photos – makes it perfect for fostering personal connections and sharing information.\n\nOur in-browser platform gives users access to professional video editing tools and features alongside a one million asset-strong stock library and hundreds of editable video templates. We're the video platform that's built with everyday editors and creators in mind.\n\nWhile Clipchamp is predominantly based in Australia, Office Product Group is a global team with offices in five countries. Joining Clipchamp means you'll join a team of colleagues who live all around the world. We’re committed to each team member feeling connected, regardless of where they work and live.\n\nAt Clipchamp, we endeavour to innovate. We believe the path to innovation lies in valuing questions, craving feedback and exploring new ideas. Team members are encouraged to take ownership and drive change, and we’ll support you in receiving the resources needed to get the job done.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nResponsibilities\n\nAnalyse Data: Use statistical tools to identify, analyse, and interpret patterns and trends in complex data sets that can assist in diagnosis and prediction. \nPrepare Reports: Prepare and present reports to management, highlighting trends, patterns, and predictions using relevant data. \nSupport Data Engineering: Assist data engineers in transforming raw data and modelling. \nReporting and Visualization: Design dashboards, create visualizations, and automate report generation. \nCross-functional Collaboration: Work closely with product teams, leadership, and other departments. \nData Strategy: Contribute to data strategy, conduct feasibility studies, and identify innovation opportunities. \nA/B Experimentation: Help teams design insightful experiments and interpret results as part of our data-driven culture. \nPromote Data Literacy: Help spread data literacy across the company. \n\nQualifications\n\nRequired Qualifications\n\nDoctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field\nOR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ year(s) data-science experience (e.g., managing structured and unstructured data, applying statistical tec\nOR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 2+ years data-science experience (e.g., managing structured and unstructured data, applying statistical tec\nOR equivalent experience.\n1+ year(s) customer-facing, project-delivery experience, professional services, and/or consulting experience.\nGreat communicator with stakeholder management skills. \nAnalytical and critical thinker who can look beyond the question to identify the real problems. \nStrong mathematical aptitude, with good understanding of probability and statistics. \nData Visualization (PowerBI is a bonus) \nStrong programming skills in Python, R, or SQL. \nUnderstanding of ETL pipelines.\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. \n\nPreferred Qualifications\n\nBachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science,\nOR related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)\nOR equivalent experience.\nLove online video, solving new, challenging problems \nHave start-up experience – ever changing landscape, experimentation, innovation, and direct impact on the direction of the company \nHave hands on experience with modern product stack for road mapping, documentation, sprint planning, research and more \nExperience with big data technologies and cloud platforms. \nFamiliarity with machine learning and predictive modelling. \nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n"
    },
    "requestContext": {
        "authorizer": {
            "claims": {
                "sub": "1234567890"
            }
        }
    }
}
