{
    "body": {
        "job_post": "\nMinimum qualifications:\n\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, and with data structures or algorithms. \n2 years of experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence, deep learning or natural language processing.\nExperience with Large Language Models, NLP, or Generative AI.\nExperience with Coding, Experiment Design, Data Analysis.\nExperience with recommendation systems/rankings/predictions.\n\nPreferred qualifications:\n\nMaster's degree or PhD in Computer Science or related technical fields.\nExperience developing accessible technologies.\nExperience with C++, Statistical Analysis, Python.\nExperience with quality work in either serving quality or data quality.\nExperience as a data analyst/scientist.\nExperience in understanding user behavior (i.e., mathematical modeling or social science background).\n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nOur goal is to organize shopping results across Google surfaces to make them relevant and helpful for users on their shopping journey. Find the best configuration of Shopping units on the Shopping pages across Google surfaces by taking into consideration a wide range of Quality and UI factors: relevance of features, position on the page, collapsed/expanded states, density of the units.\n\nPeople shop on Google more than a billion times a day - and the Commerce team is responsible for building the experiences that serve these users. The mission for Google Commerce is to be an essential part of the shopping journey for consumers - from inspiration to to a simple and secure checkout experience - and the best place for retailers/merchants to connect with consumers. We support and partner with the commerce ecosystem, from large retailers to small local merchants, to give them the tools, technology and scale to thrive in today’s digital world.\n\nResponsibilities\n\nWork in coding, modeling, and analysis.\nFind the right signals or create them if they don't exist yet. Combine them into a model that allows you to show their merit through offline evaluation. Wire these in the production stack (e.g., search and shopping) and start a live experiment.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .\n"
    },
    "requestContext": {
        "authorizer": {
            "claims": {
                "sub": "1234567890"
            }
        }
    }
}
